# config.py

# Telegram Bot Token
BOT_TOKEN = "8450613083:AAHTuSuKgSTFIhOgFLnEYh0Ix07kEsr58AI"
MONGO_URL = "mongodb://shuya:9fcc60263a946ef550d11406667404fa@127.0.0.1:27017/?replicaSet=rs0&authSource=admin"
CHANNEL_ID = -1002561997815
CHANNEL_USERNAME = "@takedbchannel"

# Set of authorized user IDs who can add/remove uploaders
AUTHORIZED_USERS = {
    7453473569,
    6857856691,
    6353916710,
    760680138,
    5147271956,
    2059829797,
    1890903731,
    7598028800,
    7301761385,
    7886646898,
    8259215649
}

# Rarity mapping
RARITY_MAPPING = {
    1: "⚪️ Common",
    2: "🟠 Rare",
    3: "🟢 Medium",
    4: "🟡 Legendary",
    5: "🏵 Exotic",
    6: "🔮 Vortex",
    7: "🎐 Celestia X",
    8: "🪩 Harmony",
    9: "🎭 Eternal",
    10: "🍭 Elixir",
    11: "💳 Custom",
    12: "💠 Originals",
    13: "☄️ Nova",
    14: "🌟 Aureo"

}
SUDO_USERS = {
    6857856691,
    1890903731,
    760680138,
    5147271956,
    7886646898
}

# Event emoji mapping
EVENT_MAPPING = {
    "🏖": "🏖𝒔𝒖𝒎𝒎𝒆𝒓🏖",
    "👘": "👘𝑲𝒊𝒎𝒐𝒏𝒐👘",
    "🧹": "🧹𝑴𝒂𝒊𝒅🧹",
    "🐰": "🐰𝑩𝒖𝒏𝒏𝒚🐰",
    "🏜": "🏜𝑬𝒈𝒚𝒑𝒕🏜",
    "🎒": "🎒𝑺𝒄𝒉𝒐𝒐𝒍🎒",
    "💞": "💞𝒓𝒐𝒎𝒂𝒏𝒄𝒆💞",
    "🎀": "🎀𝒗𝒂𝒍𝒆𝒏𝒕𝒊𝒏𝒆🎀",
    "🎃": "🎃𝑯𝒂𝒍𝒍𝒐𝒘𝒆𝒆𝒏🎃",
    "💉": "💉𝑵𝒖𝒓𝒔𝒆💉",
    "❄️": "❄️𝑾𝒊𝒏𝒕𝒆𝒓❄️",
    "🎄": "🎄𝑪𝒉𝒓𝒊𝒔𝒕𝒎𝒂𝒔🎄",
    "🚨": "🚨𝑷𝒐𝒍𝒊𝒄𝒆🚨",
    "🏀": "🏀𝑩𝒂𝒔𝒌𝒆𝒕𝒃𝒂𝒍𝒍🏀",
    "🎩": "🎩𝑻𝒖𝒙𝒆𝒅𝒐🎩",
    "🪭": "🪭𝑪𝒉𝒊𝒏𝒆𝒔𝒆🪭",
    "👙": "👙𝑩𝒊𝒌𝒊𝒏𝒊👙",
    "💍": "💍𝑴𝒂𝒓𝒓𝒊𝒆𝒅💍",
    "🎗": "🎗𝑪𝒐𝒍𝒍𝒆𝒄𝒕𝒐𝒓🎗",
    "🔞": "🔞𝑵𝒖𝒅𝒆𝒔🔞",
    "🪽": "🪽𝑯𝒆𝒂𝒗𝒆𝒏𝒍𝒚🪽",
    "☀️": "☀️𝑪𝒐𝒘𝒃𝒐𝒚☀️",
    "🌑": "🌑𝒏𝒖𝒏🌑",
    "👾": "👾𝑭𝒓𝒂𝒈𝒎𝒆𝒏𝒕👾",
    "🩸": "🩸𝑨𝒔𝒔𝒂𝒔𝒊𝒏🩸",
    "🪔": "🪔𝑫𝒊𝒘𝒂𝒍𝒊🪔",
    "🪦": "🪦𝑫𝒊𝒂 𝒅𝒆 𝒍𝒐𝒔 𝒎𝒖𝒆𝒓𝒕𝒐𝒔🪦",
    "🎮": "🎮𝑮𝒂𝒎𝒆𝒓🎮",
    "🛸": "🛸𝑶𝒎𝒏𝒊𝑽𝒆𝒓𝒔𝒆🛸",
    "🍂": "🍂𝑨𝒖𝒕𝒖𝒎𝒏🍂",
    "⛈️": "⛈️𝑇𝑒𝑚𝑝𝑒𝑠𝑡⛈️",
    "🎧": "🎧𝕂ℙ𝕆ℙ🎧",
    "🍬": "🍬𝑃𝑟𝑒𝑚𝑖𝑒𝑟🍬"
}
